# Example 1

SELECT Column

## Import libraries

In [1]:
import sqlite3
import pandas as pd

## Create a connection object

In [2]:
con = sqlite3.connect('../Database.db')
cur = con.cursor()

## SQL statement

In [3]:
# The SELECT statement is used to select data from a database.
# The data returned is stored in a result table, called the result-set.
query = '''
            SELECT CustomerName, City 
            FROM Customers
        '''

## Show table

In [4]:
df = pd.read_sql_query(query, con)
df.head()

                         CustomerName         City
0                 Alfreds Futterkiste       Berlin
1  Ana Trujillo Emparedados y helados  México D.F.
2             Antonio Moreno Taquería  México D.F.
3                     Around the Horn       London
4                  Berglunds snabbköp        Luleå

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91 entries, 0 to 90
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerName  91 non-null     object
 1   City          91 non-null     object
dtypes: object(2)
memory usage: 1.6+ KB

## Close the connection

In [6]:
con.close()